tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "temporalio/brew"
tap "typesense/tap"
tap "xo/xo"
brew "act"
brew "actionlint"
brew "aider"
brew "angle-grinder"
brew "ast-grep"
brew "atuin"
brew "localstack"
brew "awscli-local"
brew "bat"
brew "broot"
brew "cheat"
brew "chezmoi"
brew "curlie"
brew "datasette"
brew "diff-so-fancy"
brew "direnv"
brew "duf"
brew "dust"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "ghi"
brew "git"
brew "git-delta"
brew "glances"
brew "glow"
brew "gping"
brew "grex"
brew "gron"
brew "helix"
brew "hexyl"
brew "htop"
brew "http-prompt"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "kanata"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "miller"
brew "minio"
brew "neovim"
brew "netcat"
brew "nmap"
brew "nnn"
brew "pkgconf"
brew "poppler"
brew "procs"
brew "prometheus"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "rust"
brew "rustscan"
brew "scrapy"
brew "sd"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "temporal"
brew "tldr"
brew "trippy"
brew "uv"
brew "wireshark"
brew "xcodes"
brew "yazi"
brew "ykman"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "temporalio/brew/tcld"
cask "boltai"
<<<<<<< HEAD
=======
cask "canva"
cask "gitkraken-cli"
cask "google-chrome"
>>>>>>> 9cecde3 (Update .Brewfile)
cask "kitty"
cask "mullvadvpn"
cask "obsidian"
cask "osquery"
cask "red-canary-mac-monitor"
cask "tabby"
cask "yubico-yubikey-manager"
mas "Anybox", id: 1593408455
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "CleanMyMac", id: 1339170533
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Flow", id: 1423210932
mas "KakaoTalk", id: 869223134
mas "Klack", id: 6446206067
mas "LanScan", id: 472226235
mas "Logger", id: 1611554653
mas "Maccy", id: 1527619437
mas "Paste", id: 967805235
mas "PasteNow", id: 1552536109
mas "Tailscale", id: 1475387142
vscode "eamodio.gitlens"
vscode "teamhub.teamhub"
vscode "vscodevim.vim"
