##################################
# Taps
##################################

# tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "olets/tap"
tap "temporalio/brew"
tap "typesense/tap"
tap "xo/xo"

##################################
# Formulas / brews
##################################

brew "act"
brew "actionlint"
brew "aider"
brew "angle-grinder"
brew "ast-grep"
brew "atuin"
brew "localstack"
brew "awscli-local"
brew "bat"
brew "biome"
# brew "bitwarden-cli"
brew "broot"
brew "cheat"
brew "chezmoi"
brew "curlie"
brew "diff-so-fancy"
brew "duf"
brew "dust"
brew "eslint"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "pandoc"
brew "ffmpeg"
brew "fnm"
brew "esbuild"
brew "rollup"
brew "vite"
brew "fzf"
brew "gh"
brew "ghi"
brew "git"
brew "git-delta"
brew "glances"
brew "glow"
brew "gping"
brew "grex"
brew "whalebrew"
brew "gron"
brew "helix"
brew "hexyl"
brew "htop"
brew "http-prompt"
brew "hyperfine"
brew "jq"
brew "just"
brew "k9s"
brew "kanata"
brew "lazygit"
brew "luarocks"
brew "mas"
brew "mcfly"
brew "miller"
brew "minio"
brew "neovim"
brew "netcat"
brew "nnn"
# brew "nvm"
brew "onefetch"
# brew "pinentry-mac"
brew "pkgconf"
# brew "podman"
brew "poppler"
brew "prettier"
brew "procs"
brew "prometheus"
brew "pyenv"
brew "rclone"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "rustscan"
brew "scrapy"
brew "sd"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "temporal"
brew "tldr"
brew "tree"
brew "trippy"
brew "uv"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "olets/tap/zsh-abbr"
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
brew "temporalio/brew/tcld"

##################################
# Casks (GUI apps)
##################################

cask "tailscale"
cask "zen-browser"
cask "forklift"
cask "karabiner-elements"
cask "swish"
cask "motrix"
cask "lyn"
cask "orbstack"
cask "itsycal"
cask "keymapp"
cask "carbon-copy-cloner"
cask "qlmarkdown"
cask "soulver"
cask "kaleidoscope"
cask "httpie"
cask "hopper-disassembler"
cask "maccy"
cask "little-snitch"
cask "lm-studio"
cask "betterdisplay"
cask "homerow"
cask "todoist"
cask "proxyman"
cask "hammerspoon"
cask "fork"
cask "bruno"
cask "spotify"
cask "bartender"
cask "termius"
cask "arc"
cask "warp"
cask "raycast"
cask "superhuman"
cask "devtoys"
cask "devutils"
cask "istat-menus"
cask "chatgpt"
cask "claude"
cask "dash"
brew "temporalio/brew/tcld"
cask "arc"
cask "bartender"
cask "boltai"
cask "bruno"
cask "canva"
cask "carbon-copy-cloner"
cask "charmstone"
cask "chatgpt"
cask "claude"
cask "dash"
cask "devtoys"
cask "devutils"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "homerow"
cask "hoppscotch"
cask "httpie"
cask "kaleidoscope"
cask "karabiner-elements"
cask "kitty"
cask "lm-studio"
cask "motrix"
cask "mullvadvpn"
cask "obsidian"
cask "orbstack"
cask "osquery"
cask "pdf-expert"
cask "visual-studio-code"
cask "tabby"
cask "ollama"
cask "proxyman"
cask "raycast"
cask "red-canary-mac-monitor"
cask "signal"
cask "slack"
cask "spotify"
cask "superhuman"
cask "synologyassistant"
cask "tabby"
cask "termius"
cask "todoist"
cask "visual-studio-code"
cask "warp"
cask "wireshark"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"

##################################
# Mac App Store (mas CLI) apps
##################################

mas "Anybox", id: 1593408455
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Data Jar", id: 1453273600
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Flow", id: 1423210932
mas "KakaoTalk", id: 869223134
mas "LanScan", id: 472226235
mas "Logger", id: 1611554653
mas "Maccy", id: 1527619437
mas "Menu Box", id: 6463440793
mas "Paste", id: 967805235
mas "Mela – Recipe Manager", id: 1568924476
mas "Ice Cubes for Mastodon", id: 6444915884
mas "Pixea", id: 1507782672

##################################
# VSCode / Cursor extensions
##################################

# vscode "42crunch.vscode-openapi"
# vscode "4ops.terraform"
# vscode "aaron-bond.better-comments"
# vscode "actboy168.lua-debug"
# vscode "akamud.vscode-javascript-snippet-pack"
# vscode "alefragnani.bookmarks"
# vscode "alefragnani.project-manager"
# vscode "alefragnani.rtf"
# vscode "amazonwebservices.aws-toolkit-vscode"
# vscode "antfu.browse-lite"
# vscode "antfu.icons-carbon"
# vscode "antfu.vite"
# vscode "arcticicestudio.nord-visual-studio-code"
# vscode "arrterian.nix-env-selector"
# vscode "arturock.gitstash"
# vscode "ashinzekene.nestjs"
# vscode "asvetliakov.vscode-neovim"
# vscode "atishay-jain.all-autocomplete"
# vscode "atlassian.atlascode"
# vscode "batisteo.vscode-django"
# vscode "bbenoist.nix"
# vscode "biomejs.biome"
# vscode "blackboxapp.blackbox"
# vscode "bodil.file-browser"
# vscode "bradlc.vscode-tailwindcss"
# vscode "buenon.scratchpads"
# vscode "burkeholland.simple-react-snippets"
# vscode "bysabi.prettier-vscode-standard"
# vscode "catppuccin.catppuccin-vsc"
# vscode "chaitanyashahare.lazygit"
# vscode "charliermarsh.ruff"
# vscode "christian-kohler.npm-intellisense"
# vscode "christian-kohler.path-intellisense"
# vscode "chrmarti.regex"
# vscode "ckolkman.vscode-postgres"
# vscode "clinyong.vscode-css-modules"
# vscode "codium.codium"
# vscode "continue.continue"
# vscode "cstrap.flask-snippets"
# vscode "cstrap.python-snippets"
# vscode "danielsanmedium.dscodegpt"
# vscode "dart-code.dart-code"
# vscode "dart-code.flutter"
# vscode "davidanson.vscode-markdownlint"
# vscode "dbaeumer.vscode-eslint"
# vscode "deerawan.vscode-dash"
# vscode "diemasmichiels.emulate"
# vscode "divyanshuagrawal.competitive-programming-helper"
# vscode "donjayamanne.python-environment-manager"
# vscode "donjayamanne.python-extension-pack"
# vscode "dsznajder.es7-react-js-snippets"
# vscode "dzhavat.bracket-pair-toggler"
# vscode "eamodio.gitlens"
# vscode "ecmel.vscode-html-css"
# vscode "editorconfig.editorconfig"
# vscode "emmanuelbeziat.vscode-great-icons"
# vscode "enkia.tokyo-night"
# vscode "equimper.react-native-react-redux"
# vscode "ericsia.pythonsnippets3"
# vscode "eriklynd.json-tools"
# vscode "evan-buss.font-switcher"
# vscode "file-icons.file-icons"
# vscode "fill-labs.dependi"
# vscode "firsttris.vscode-jest-runner"
# vscode "formulahendry.auto-close-tag"
# vscode "formulahendry.auto-rename-tag"
# vscode "formulahendry.code-runner"
# vscode "foxundermoon.shell-format"
# vscode "frhtylcn.pythonsnippets"
# vscode "george-alisson.html-preview-vscode"
# vscode "github.codespaces"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.remotehub"
# vscode "github.vscode-github-actions"
# vscode "github.vscode-pull-request-github"
# vscode "golang.go"
# vscode "graphql.vscode-graphql-syntax"
# vscode "gruntfuggly.todo-tree"
# vscode "hashicorp.terraform"
# vscode "honnamkuan.golang-snippets"
# vscode "humao.rest-client"
# vscode "ibm.output-colorizer"
# vscode "idered.npm"
# vscode "infeng.vscode-react-typescript"
# vscode "inferrinizzard.prettier-sql-vscode"
# vscode "infracost.infracost"
# vscode "jacano.vscode-pnpm"
# vscode "jasonnutter.search-node-modules"
# vscode "jawandarajbir.react-vscode-extension-pack"
# vscode "jebbs.plantuml"
# vscode "jithurjacob.nbpreviewer"
# vscode "jnoortheen.nix-ide"
# vscode "kahole.magit"
# vscode "kamikillerto.vscode-colorize"
# vscode "kevinrose.vsc-python-indent"
# vscode "kisstkondoros.vscode-codemetrics"
# vscode "lastmile-ai.vscode-aiconfig"
# vscode "launchdarklyofficial.launchdarkly"
# vscode "leetcode.vscode-leetcode"
# vscode "leodevbro.blockman"
# vscode "magicstack.magicpython"
# vscode "mathematic.vscode-latex"
# vscode "mattflower.aider"
# vscode "mechatroner.rainbow-csv"
# vscode "mgesbert.python-path"
# vscode "mgmcdermott.vscode-language-babel"
# vscode "mikestead.dotenv"
# vscode "mintlify.document"
# vscode "mkhl.direnv"
# vscode "ms-azuretools.vscode-azureresourcegroups"
# vscode "ms-azuretools.vscode-azurestorage"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# vscode "ms-mssql.data-workspace-vscode"
# vscode "ms-playwright.playwright"
# vscode "ms-python.black-formatter"
# vscode "ms-python.debugpy"
# vscode "ms-python.flake8"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode.azure-account"
# vscode "ms-vscode.azure-repos"
# vscode "ms-vscode.azurecli"
# vscode "ms-vscode.hexeditor"
# vscode "ms-vscode.js-debug-nightly"
# vscode "ms-vscode.live-server"
# vscode "ms-vscode.makefile-tools"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-repositories"
# vscode "ms-vscode.vscode-speech"
# vscode "ms-vscode.vscode-typescript-next"
# vscode "msjsdiag.vscode-react-native"
# vscode "mtxr.sqltools"
# vscode "mtxr.sqltools-driver-pg"
# vscode "naumovs.color-highlight"
# vscode "njpwerner.autodocstring"
# vscode "nrwl.angular-console"
# vscode "oderwat.indent-rainbow"
# vscode "oouo-diogo-perdigao.docthis"
# vscode "orta.vscode-jest"
# vscode "oven.bun-vscode"
# vscode "parallelsdesktop.parallels-desktop"
# vscode "pflannery.vscode-versionlens"
# vscode "phind.phind"
# vscode "pinage404.nix-extension-pack"
# vscode "pkief.material-icon-theme"
# vscode "planbcoding.vscode-react-refactor"
# vscode "pmneo.tsimporter"
# vscode "postman.postman-for-vscode"
# vscode "prisma.prisma"
# vscode "pulkitgangwar.nextjs-snippets"
# vscode "qassimfarid.ejs-language-support"
# vscode "qcz.text-power-tools"
# vscode "quicktype.quicktype"
# vscode "rangav.vscode-thunder-client"
# vscode "redhat.vscode-xml"
# vscode "redhat.vscode-yaml"
# vscode "redocly.openapi-vs-code"
# vscode "richie5um2.vscode-sort-json"
# vscode "ritwickdey.liveserver"
# vscode "rubbersheep.gi"
# vscode "rubymaniac.vscode-paste-and-indent"
# vscode "rust-lang.rust-analyzer"
# vscode "rvest.vs-code-prettier-eslint"
# vscode "ryanluker.vscode-coverage-gutters"
# vscode "ryu1kn.edit-with-shell"
# vscode "ryu1kn.partial-diff"
# vscode "shd101wyy.markdown-preview-enhanced"
# vscode "sidneys1.gitconfig"
# vscode "sidthesloth.html5-boilerplate"
# vscode "skellock.just"
# vscode "skyran.js-jsx-snippets"
# vscode "sleistner.vscode-fileutils"
# vscode "slevesque.vscode-multiclip"
# vscode "sourcegraph.cody-ai"
# vscode "sourcery.sourcery"
# vscode "standard.vscode-standard"
# vscode "statelyai.stately-vscode"
# vscode "stringham.move-ts"
# vscode "styled-components.vscode-styled-components"
# vscode "sumneko.lua"
# vscode "supermaven.supermaven"
# vscode "tabnine.tabnine-vscode"
# vscode "tamasfe.even-better-toml"
# vscode "teabyii.ayu"
# vscode "teamhub.teamhub"
# vscode "techer.open-in-browser"
# vscode "tim-koehler.helm-intellisense"
# vscode "tombonnike.vscode-status-bar-format-toggle"
# vscode "tomoki1207.pdf"
# vscode "tomrijndorp.find-it-faster"
# vscode "tonka3000.raycast"
# vscode "tyriar.sort-lines"
# vscode "usernamehw.errorlens"
# vscode "vadimcn.vscode-lldb"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "vivaxy.vscode-conventional-commits"
# vscode "vscode-icons-team.vscode-icons"
# vscode "vscodevim.vim"
# vscode "aaron-bond.better-comments"
# vscode "akamud.vscode-javascript-snippet-pack"
# vscode "alefragnani.bookmarks"
# vscode "alefragnani.project-manager"
# vscode "alefragnani.rtf"
# vscode "antfu.vite"
# vscode "buenon.scratchpads"
# vscode "burkeholland.simple-react-snippets"
# vscode "catppuccin.catppuccin-vsc"
# vscode "chaitanyashahare.lazygit"
# vscode "christian-kohler.npm-intellisense"
# vscode "christian-kohler.path-intellisense"
# vscode "chrmarti.regex"
# vscode "codezombiech.gitignore"
# vscode "cstrap.flask-snippets"
# vscode "cstrap.python-snippets"
# vscode "deerawan.vscode-dash"
# vscode "divyanshuagrawal.competitive-programming-helper"
# vscode "donjayamanne.python-environment-manager"
# vscode "donjayamanne.python-extension-pack"
# vscode "dsznajder.es7-react-js-snippets"
# vscode "dzhavat.bracket-pair-toggler"
# vscode "ecmel.vscode-html-css"
# vscode "editorconfig.editorconfig"
# vscode "emmanuelbeziat.vscode-great-icons"
# vscode "enkia.tokyo-night"
# vscode "ericsia.pythonsnippets3"
# vscode "eriklynd.json-tools"
# vscode "evan-buss.font-switcher"
# vscode "file-icons.file-icons"
# vscode "firsttris.vscode-jest-runner"
# vscode "formulahendry.auto-close-tag"
# vscode "formulahendry.auto-rename-tag"
# vscode "formulahendry.code-runner"
# vscode "foxundermoon.shell-format"
# vscode "frhtylcn.pythonsnippets"
# vscode "george-alisson.html-preview-vscode"
# vscode "github.codespaces"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.remotehub"
# vscode "github.vscode-github-actions"
# vscode "github.vscode-pull-request-github"
# vscode "golang.go"
# vscode "graphql.vscode-graphql-syntax"
# vscode "honnamkuan.golang-snippets"
# vscode "humao.rest-client"
# vscode "ibm.output-colorizer"
# vscode "idered.npm"
# vscode "infeng.vscode-react-typescript"
# vscode "infracost.infracost"
# vscode "jacano.vscode-pnpm"
# vscode "jasonnutter.search-node-modules"
# vscode "jawandarajbir.react-vscode-extension-pack"
# vscode "jebbs.plantuml"
# vscode "jithurjacob.nbpreviewer"
# vscode "kahole.magit"
# vscode "kamikillerto.vscode-colorize"
# vscode "kevinrose.vsc-python-indent"
# vscode "kisstkondoros.vscode-codemetrics"
# vscode "lastmile-ai.vscode-aiconfig"
# vscode "leetcode.vscode-leetcode"
# vscode "leodevbro.blockman"
# vscode "magicstack.magicpython"
# vscode "mathematic.vscode-latex"
# vscode "mattflower.aider"
# vscode "mechatroner.rainbow-csv"
# vscode "mgesbert.python-path"
# vscode "mintlify.document"
# vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
# vscode "ms-mssql.data-workspace-vscode"
# vscode "ms-playwright.playwright"
# vscode "naumovs.color-highlight"
# vscode "njpwerner.autodocstring"
# vscode "nrwl.angular-console"
# vscode "oderwat.indent-rainbow"
# vscode "oouo-diogo-perdigao.docthis"
# vscode "orta.vscode-jest"
# vscode "pflannery.vscode-versionlens"
# vscode "pkief.material-icon-theme"
# vscode "planbcoding.vscode-react-refactor"
# vscode "pmneo.tsimporter"
# vscode "prisma.prisma"
# vscode "pulkitgangwar.nextjs-snippets"
# vscode "qassimfarid.ejs-language-support"
# vscode "quicktype.quicktype"
# vscode "redhat.vscode-xml"
# vscode "redhat.vscode-yaml"
# vscode "richie5um2.vscode-sort-json"
# vscode "ritwickdey.liveserver"
# vscode "rubymaniac.vscode-paste-and-indent"
# vscode "rust-lang.rust-analyzer"
# vscode "rvest.vs-code-prettier-eslint"
# vscode "ryanluker.vscode-coverage-gutters"
# vscode "ryu1kn.partial-diff"
# vscode "shd101wyy.markdown-preview-enhanced"
# vscode "sidneys1.gitconfig"
# vscode "sidthesloth.html5-boilerplate"
# vscode "skellock.just"
# vscode "skyran.js-jsx-snippets"
# vscode "sleistner.vscode-fileutils"
# vscode "slevesque.vscode-multiclip"
# vscode "standard.vscode-standard"
# vscode "statelyai.stately-vscode"
# vscode "stringham.move-ts"
# vscode "styled-components.vscode-styled-components"
# vscode "sumneko.lua"
# vscode "teabyii.ayu"
# vscode "tomoki1207.pdf"
# vscode "tomrijndorp.find-it-faster"
# vscode "usernamehw.errorlens"
# vscode "vivaxy.vscode-conventional-commits"
# vscode "vscode-icons-team.vscode-icons"
# vscode "vsls-contrib.gitdoc"
# vscode "vspacecode.vspacecode"
# vscode "vspacecode.whichkey"
# vscode "wayou.vscode-todo-highlight"
# vscode "whizkydee.material-palenight-theme"
# vscode "wholroyd.jinja"
# vscode "wix.vscode-import-cost"
# vscode "xabikos.javascriptsnippets"
# vscode "xabikos.reactsnippets"
# vscode "yinfei.luahelper"
# vscode "yoavbls.pretty-ts-errors"
# vscode "yzhang.markdown-all-in-one"
# vscode "zainchen.json"
# vscode "zhuangtongfa.material-theme"

# vscode "zenstack.zenstack"
# vscode "zhuangtongfa.material-theme"
